app/Http/Controllers/api/ReservationController.php

    public function index()
    {
        $reservations = Reservation::all();

        if(count($reservations) === 0) {
            return response()->json([
                'message' => 'Aucune réservation n\'a été trouvée.'
            ]);
        }

        foreach($reservations as $reservation) {
            $user = User::findOrFail($reservation->user);
            $room = Room::findOrFail($reservation->room);
---
select * from `reservations`
select * from `users` where `users`.`id` = 2 limit 1
select * from `rooms` where `rooms`.`id` = 10 limit 1

    public function store(ReservationStoreRequest $request)
    {
        $user = User::findOrFail($request->user);
        $room = Room::findOrFail($request->room);

        $reservation = Reservation::create([
            'user' => $user->id,
            'room' => $room->id,
            'start_at' => $request->start_at,
            'end_at' => $request->end_at
        ]);
---
select * from `users` where `users`.`id` is null limit 1
select * from `rooms` where `rooms`.`id` = '5' limit 1
insert into `reservations` (`user_id`, `room_id`, `start_at`, `end_at`, `updated_at`, `created_at`) values (12, 5, '2023-06-09 13:41:07', '2023-06-09 13:41:07', '2023-06-09 16:05:29', '2023-06-09 16:05:29')