app/Http/Controllers/api/RoomController.php

select * from `rooms` where `rooms`.`id` = '2' limit 1
delete from `rooms` where `id` = 2
---
    public function destroy(string $id)
    {
        // Delete an user
        $room = Room::findOrFail($id);
        $room->delete();