app/Http/Controllers/api/UserController.php

select * from `users`
---
    public function index()
    {
        $users = User::all(['id', 'first_name', 'last_name', 'email', 'roles', 'created_at', 'updated_at']);

insert into `users` (`first_name`, `last_name`, `email`, `password`, `roles`, `updated_at`, `created_at`) values ('John', 'Doe', 'john.doe@example.com', '$2y$10$WYT/yQCd4gd0ztlE6jNukuuxEj21oj9/5v7K6KHDZsipBlNyjLNpK', '[\"user\"]', '2023-06-09 16:40:10', '2023-06-09 16:40:10')
---
    public function store(UserStoreRequest $request)
    {
        // Store a new user
        $user = User::create([
            'first_name' => ucfirst($request->first_name),
            'last_name' => ucfirst($request->last_name),
            'email' => $request->email,
            'password' => Hash::make($request->password),
            'roles' => json_encode(['user'])
        ]);

select * from `users` where `users`.`id` = '2' limit 1
delete from `users` where `id` = 2
---
    public function destroy(Request $request, string $id)
    {
        if(in_array('admin', json_decode($request->user()->roles)) === false) {
            return response()->json([
                'message' => 'Vous n\'avez pas les droits pour accéder à cette ressource.'
            ]);
        }

        // Delete an user
        $user = User::findOrFail($id);
        $user->delete();