app/Http/Controllers/AuthController.php

select * from `users` where `email` = 'john.doe@example.com' limit 1
---
    public function login(Request $request)
    {
        $credentials = $request->only(['email', 'password']);

        if(!$token = auth()->attempt($credentials)) {
            // Store token in database in remember_token column
            $user = User::where('email', $request->email)->first();